GHB2/src/InformationRegisters/гхб_РуководителиЛокаций/гхб_РуководителиЛокаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_РуководителиЛокаций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_РуководителиЛокаций/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьЛокацииПоРуководителю(_Руководитель = Неопределено) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_РуководителиЛокацийСрезПоследних.Локация КАК Локация
	               |ИЗ
	               |	РегистрСведений.гхб_РуководителиЛокаций.СрезПоследних КАК гхб_РуководителиЛокацийСрезПоследних";
	
	
	Если НЕ (_Руководитель = Неопределено) Тогда
		Запрос.Текст = Запрос.Текст + "
	               |ГДЕ
	               |	гхб_РуководителиЛокацийСрезПоследних.Руководитель = &Руководитель";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Руководитель", _Руководитель);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Локация");
	
КонецФункции

Функция ВернутьРуководителяЛокации(_Локация) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_РуководителиЛокацийСрезПоследних.Руководитель КАК Руководитель
	               |ИЗ
	               |	РегистрСведений.гхб_РуководителиЛокаций.СрезПоследних(, Локация = &Локация) КАК гхб_РуководителиЛокацийСрезПоследних";
	
	Запрос.УстановитьПараметр("Локация", _Локация);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Руководитель, Справочники.гхб_ФизическиеЛица.ПустаяСсылка());
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
